In [ ]:
#!sudo apt-get install libpq-dev -y
!pip install psycopg2

# General psql queries

In [1]:
import psycopg2

In [4]:
#открываем соединение
conn_string="dbname='{}' user='{}' host='{}' password='{}'".format("titanik_db4", "student4",
                                                                  "ec2-18-202-17-151.eu-west-1.compute.amazonaws.com",
                                                                  "student4")
conn = psycopg2.connect(conn_string)
cursor = conn.cursor()

# Создаем таблицы в базе

In [3]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

data = pd.read_csv("../lecture_05_ml/notebooks/titanik.tsv", sep='|', index_col=0)
data['prename'] = data['name'].apply(lambda x: x.split()[1].strip("."))
data['pclass'] = data['pclass'].apply(str)
data['age'].fillna(0, inplace=True)
data['age'] = data['age'].apply(float)
data['fare'].fillna(0, inplace=True)
data['fare'] = data['fare'].apply(float)
data['embarked'].fillna("None", inplace=True)

lbl_embarked = LabelEncoder().fit(data['embarked'])
lbl_pclass = LabelEncoder().fit(data['pclass'])
lbl_prename = LabelEncoder().fit(data['prename'])
lbl_sex = LabelEncoder().fit(data['sex'])

data['embarked'] = lbl_embarked.transform(data['embarked'])
data['pclass'] = lbl_pclass.transform(data['pclass'])
data['prename'] = lbl_prename.transform(data['prename'])
data['sex'] = lbl_sex.transform(data['sex'])

data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,prename
0,0,1,"Allen, Miss. Elisabeth Walton",0,29.0000,0,0,24160,211.3375,B5,3,2,NaN,"St Louis, MO",16
1,0,1,"Allison, Master. Hudson Trevor",1,0.9167,1,2,113781,151.5500,C22 C26,3,11,NaN,"Montreal, PQ / Chesterville, ON",13
2,0,0,"Allison, Miss. Helen Loraine",0,2.0000,1,2,113781,151.5500,C22 C26,3,NaN,NaN,"Montreal, PQ / Chesterville, ON",16
3,0,0,"Allison, Mr. Hudson Joshua Creighton",1,30.0000,1,2,113781,151.5500,C22 C26,3,NaN,135.0,"Montreal, PQ / Chesterville, ON",19
4,0,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",0,25.0000,1,2,113781,151.5500,C22 C26,3,NaN,NaN,"Montreal, PQ / Chesterville, ON",20

In [40]:
for d in data[:4]:
    print(d)

pclass
survived
name
sex
age
sibsp
parch
ticket
fare
cabin
embarked
boat
body
home.dest
prename

In [5]:
# Создадим впомогательные таблицы и заполним их
create_additional = '''
        CREATE TABLE embarked (
        embarked_id serial PRIMARY KEY,
        embarked_type VARCHAR(10) NOT NULL UNIQUE
        );
        CREATE TABLE pclass (
        pclass_id serial PRIMARY KEY,
        pclass_type VARCHAR(10) NOT NULL UNIQUE
        );
        '''
cursor.execute(create_additional)
conn.commit()

In [6]:
insert_query = '''INSERT INTO embarked (embarked_id, embarked_type) VALUES (%s, %s)'''
cursor.executemany(insert_query, list(zip(range(len(lbl_embarked.classes_)), lbl_embarked.classes_)))
conn.commit()
insert_query = '''INSERT INTO pclass (pclass_id, pclass_type) VALUES (%s, %s)'''
cursor.executemany(insert_query, list(zip(range(len(lbl_pclass.classes_)), lbl_pclass.classes_)))
conn.commit()

In [25]:
#TODO Создайте таблицу для prename (и заполните её)
create_prename = """CREATE TABLE prename (
                    prename_id serial PRIMARY KEY,
                    prename VARCHAR NOT NULL 
                    )"""
cursor.execute(create_prename)
conn.commit()

In [31]:
conn.commit()

In [26]:
insert_query = '''INSERT INTO prename VALUES (%s, %s)'''
cursor.executemany(insert_query, list(zip(range(len(lbl_prename.classes_)), lbl_prename.classes_)))
conn.commit()

In [27]:
#TODO Создайте таблицу для пола
create_sex = """CREATE TABLE sex (
                    sex_id serial PRIMARY KEY,
                    sex VARCHAR NOT NULL 
                    )"""
cursor.execute(create_sex)
conn.commit()

In [32]:
insert_query = '''INSERT INTO sex VALUES (%s, %s)'''
cursor.executemany(insert_query, list(zip(range(len(lbl_sex.classes_)), lbl_sex.classes_)))
conn.commit()

In [33]:
data.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest', 'prename'],
      dtype='object')

In [34]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 1308
Data columns (total 15 columns):
pclass       1309 non-null int64
survived     1309 non-null int64
name         1309 non-null object
sex          1309 non-null int64
age          1309 non-null float64
sibsp        1309 non-null int64
parch        1309 non-null int64
ticket       1309 non-null object
fare         1309 non-null float64
cabin        295 non-null object
embarked     1309 non-null int64
boat         486 non-null object
body         121 non-null float64
home.dest    745 non-null object
prename      1309 non-null int64
dtypes: float64(3), int64(7), object(5)
memory usage: 163.6+ KB

In [50]:
cursor.execute("DROP TABLE titanik;")
conn.commit()

In [51]:
#TODO создать основную таблицу
create_table = """
    CREATE TABLE titanik (
        id serial PRIMARY KEY,
        id_pclass INT REFERENCES pclass(pclass_id),
        survived INT,
        name VARCHAR,
        id_sex INT REFERENCES sex(sex_id),
        age FLOAT,
        sibsp INT,
        parch INT,
        ticket VARCHAR,
        fare FLOAT,
        cabin VARCHAR,
        id_embarked INT REFERENCES embarked(embarked_id),
        boat VARCHAR,
        body VARCHAR,
        dest VARCHAR,
        id_prename INT REFERENCES prename(prename_id)
    )
    
"""

cursor.execute(create_table)
conn.commit()

In [52]:
#TODO вставьте данные из таблицы
insert_query = '''
    INSERT INTO titanik (id_pclass, survived, name, id_sex, age, sibsp, parch, ticket, fare, cabin, id_embarked, boat, body, dest, id_prename)
     VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
'''
cursor.executemany(insert_query, data.values[:10])
conn.commit()

In [76]:
conn.commit()

In [65]:
#TODO Вопрос Кого больше мужчин или женщин?
select = """SELECT count(*) FROM titanik WHERE id_sex=1
            UNION ALL
            SELECT count(*) FROM titanik WHERE id_sex=0"""
cursor.execute(select)
print(cursor.fetchall())

[(5,), (5,)]

In [77]:
#TODO Вопрос Какой процент мужчин выжил и какой процент женщин?
select = """WITH cnt_plp as (SELECT count(*) as cnt FROM titanik)
            SELECT count(*)/cnt_plp.cnt FROM titanik WHERE id_sex=1"""
cursor.execute(select)
print(cursor.fetchall())

UndefinedTable: missing FROM-clause entry for table "cnt_plp"
LINE 2:             SELECT count(*)/cnt_plp.cnt FROM titanik WHERE i...
                                    ^

In [ ]:
#TODO Что вы можете сказать выживаемости пассижиров разного класса и пола?